SoyVitouPro/ESP32-V2/src/main.cpp
// ESP32 HUB75 + WebServer pipeline:
// - Browser renders Khmer text (proper shaping) to Canvas
// - Canvas is cropped and converted to RGB565 in JS
// - Browser uploads RGB565 blob to ESP32
// - ESP32 displays the uploaded bitmap on the HUB75 panel

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <FS.h>
#include <LittleFS.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <ESP32-VirtualMatrixPanel-I2S-DMA.h>
#include <string.h>
#include <vector>
#include <nvs_flash.h>
#include <nvs.h>
#include "esp_system.h"
#include "esp_heap_caps.h"
#include <driver/i2s.h>

// Panel configuration (defaults). Adjust via UI if needed.
#ifndef PANEL_RES_X
#define PANEL_RES_X 128
#endif
#ifndef PANEL_RES_Y
#define PANEL_RES_Y 64
#endif
#ifndef NUM_ROWS
#define NUM_ROWS 1
#endif
#ifndef NUM_COLS
#define NUM_COLS 1
#endif
#define PANEL_CHAIN (NUM_ROWS * NUM_COLS)

// Runtime layout (allows switching panel configurations without recompiling)
static int cur_rows = NUM_ROWS;   // current layout rows
static int cur_cols = NUM_COLS;   // current layout cols
static inline int VIRT_W() { return cur_cols * PANEL_RES_X; }
static inline int VIRT_H() { return cur_rows * PANEL_RES_Y; }

// Panel chain orientation mapping (do not define macros with same names as enum constants)
// Legacy workflow used numeric defines like 0x02; with the current library use enum values.
// To mirror/reverse horizontally as per your request to switch from 0x02 to 0x01,
// set VIRTUAL_MATRIX_CHAIN_TYPE to CHAIN_BOTTOM_RIGHT_UP instead of CHAIN_BOTTOM_LEFT_UP.
#define VIRTUAL_MATRIX_CHAIN_TYPE CHAIN_BOTTOM_RIGHT_UP

// GPIO mapping

// Define GPIO Pins for ESP32-S3-WROOM-1
#define R1_PIN 4
#define G1_PIN 5
#define B1_PIN 6
#define R2_PIN 7
#define G2_PIN 15
#define B2_PIN 16
#define A_PIN 17
#define B_PIN 18
#define C_PIN 8
#define D_PIN 3
#define E_PIN 46
#define LAT_PIN 9
#define OE_PIN 10
#define CLK_PIN 11

MatrixPanel_I2S_DMA *dma_display = nullptr;
VirtualMatrixPanel  *vdisplay = nullptr;

// Wi-Fi SoftAP config
static const char* AP_SSID = "KHMER_PANEL";
static const char* AP_PASS = "12341234"; // 8+ chars required

WebServer server(80);

// CORS headers for cross-origin requests
void sendCORSHeaders() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
}

// ================= I2S Tick-Tock Sound (MAX98357A) =================
// I2S pins — ensure they are not used by HUB75
#define I2S_DOUT 12
#define I2S_BCLK 13
#define I2S_LRC  14
#define I2S_PORT I2S_NUM_0
#define SAMPLE_RATE 16000

static bool i2sReady = false;
static bool soundBuffersReady = false;
enum SoundMode { SOUND_OFF=0, SOUND_CRICK=1, SOUND_SOFT=2, SOUND_WOOD=3, SOUND_BEEP=4 };
static volatile SoundMode gSoundMode = SOUND_CRICK;
static volatile int gSoundVolume = 80; // 0..100 percent

static void setupI2S() {
  if (i2sReady) return;
  i2s_config_t i2s_config = {
    .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX),
    .sample_rate = SAMPLE_RATE,
    .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
    .channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT,
    .communication_format = I2S_COMM_FORMAT_STAND_I2S,
    .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
    .dma_buf_count = 4,
    .dma_buf_len = 128,
    .use_apll = true,
    .tx_desc_auto_clear = true,
    .fixed_mclk = 0
  };
  i2s_pin_config_t pin_config = {
    .bck_io_num = I2S_BCLK,
    .ws_io_num = I2S_LRC,
    .data_out_num = I2S_DOUT,
    .data_in_num = I2S_PIN_NO_CHANGE
  };
  if (i2s_driver_install(I2S_PORT, &i2s_config, 0, NULL) != ESP_OK) {
    Serial.println("i2s_driver_install failed");
    return;
  }
  if (i2s_set_pin(I2S_PORT, &pin_config) != ESP_OK) {
    Serial.println("i2s_set_pin failed");
    return;
  }
  i2s_zero_dma_buffer(I2S_PORT);
  i2sReady = true;
}

static bool writeI2SBuffer(int16_t* buf, size_t samplesStereo) {
  size_t bytesToWrite = samplesStereo * sizeof(int16_t);
  size_t bytesWritten = 0;
  esp_err_t err = i2s_write(I2S_PORT, (const void*)buf, bytesToWrite, &bytesWritten, portMAX_DELAY);
  return (err == ESP_OK) && (bytesWritten == bytesToWrite);
}

// ================= Preloaded Sound Buffers =================
// Precompute for discrete volume levels to avoid per-play scaling
static const int kVolLevels[5] = {20, 40, 60, 80, 100};
static volatile int gSoundVolIndex = 3; // default 80% -> index 3

// Max stereo samples we will store (for ~30ms at 16kHz: 480 mono -> 960 stereo)
static const int kMaxStereo = 1200;
static int16_t gCrickBuf[5][kMaxStereo];
static int16_t gSoftBuf[5][kMaxStereo];
static int gCrickLenStereo = 0;
static int gSoftLenStereo = 0;

static void buildClickInto(int16_t* outStereo, int& outLenStereo,
                           float f1, float f2, int durationMs, float baseAmp, int volPercent) {
  const int samples = (SAMPLE_RATE * durationMs) / 1000;
  const int stereo = samples * 2;
  outLenStereo = stereo;
  if (outLenStereo > kMaxStereo) outLenStereo = kMaxStereo;
  float p1 = 0.0f, p2 = 0.0f;
  const float s1 = 2.0f * (float)M_PI * f1 / (float)SAMPLE_RATE;
  const float s2 = 2.0f * (float)M_PI * f2 / (float)SAMPLE_RATE;
  // Map 0..100 to 0..4.0 with safety clamp
  const float vol = fmaxf(0.0f, fminf((float)volPercent / 25.0f, 4.0f));
  const int fadeInN = (int)fminf(12.0f, durationMs * SAMPLE_RATE / 1000.0f * 0.006f);   // ~0.6% of duration
  const int fadeOutN = (int)fminf(20.0f, durationMs * SAMPLE_RATE / 1000.0f * 0.012f);  // ~1.2% of duration
  for (int i = 0; i < samples; ++i) {
    float t = (float)i / (float)(samples - 1);
    // Base envelopes: fast decay for crick, gentle for soft (handled via baseAmp and freqs)
    float env = expf(-7.0f * t);
    // Micro fade-in/out to avoid clicks at start/end
    float fade = 1.0f;
    if (fadeInN > 0 && i < fadeInN) fade = (float)i / (float)fadeInN;
    if (fadeOutN > 0 && i >= samples - fadeOutN) {
      float r = (float)(samples - i) / (float)fadeOutN;
      if (r < fade) fade = r;
    }
    float y = (sinf(p1) * 0.65f + sinf(p2) * 0.35f) * baseAmp * env * vol * fade;
    int16_t v = (int16_t)fmaxf(fminf(y, 32767.0f), -32768.0f);
    if ((i * 2 + 1) < kMaxStereo) { outStereo[i * 2] = v; outStereo[i * 2 + 1] = v; }
    p1 += s1; if (p1 > 2.0f * (float)M_PI) p1 -= 2.0f * (float)M_PI;
    p2 += s2; if (p2 > 2.0f * (float)M_PI) p2 -= 2.0f * (float)M_PI;
  }
}

static void buildSoundBuffers() {
  if (soundBuffersReady) return;
  // Crick: bright
  for (int i = 0; i < 5; ++i) buildClickInto(gCrickBuf[i], gCrickLenStereo, 3800.0f, 5600.0f, 20, 28000.0f, kVolLevels[i]);
  // Soft: gentler
  for (int i = 0; i < 5; ++i) buildClickInto(gSoftBuf[i], gSoftLenStereo, 2400.0f, 3200.0f, 18, 20000.0f, kVolLevels[i]);
  soundBuffersReady = true;
}

static void playTick() {
  if (!soundBuffersReady) buildSoundBuffers();
  writeI2SBuffer(gCrickBuf[gSoundVolIndex], gCrickLenStereo);
}

