SoyVitouPro/ESP32-V2/src/main.cpp
static void playSoft() {
  if (!soundBuffersReady) buildSoundBuffers();
  writeI2SBuffer(gSoftBuf[gSoundVolIndex], gSoftLenStereo);
}

static void playTock() {
  // Deeper "tock": lower resonant tone with slight downward pitch glide and slower decay
  const int duration_ms = 55; // ~55 ms
  const int samples = (SAMPLE_RATE * duration_ms) / 1000;
  const float fStart = 900.0f, fEnd = 600.0f; // glide
  const float amp = 26000.0f;
  const float vol = fmaxf(0.0f, fminf((float)gSoundVolume / 25.0f, 4.0f));

  int16_t* buffer = (int16_t*)malloc(samples * 2 * sizeof(int16_t));
  if (!buffer) return;
  float phase = 0.0f;
  for (int i = 0; i < samples; ++i) {
    float t = (float)i / (float)(samples - 1);
    float f = fStart + (fEnd - fStart) * t;
    float step = 2.0f * (float)M_PI * f / (float)SAMPLE_RATE;
    // exponential decay envelope
    float env = expf(-3.5f * t);
    float sF = sinf(phase) * amp * env * vol;
    int16_t s = (int16_t)fmaxf(fminf(sF, 32767.0f), -32768.0f);
    buffer[i*2] = s; buffer[i*2+1] = s;
    phase += step; if (phase > 2.0f * (float)M_PI) phase -= 2.0f * (float)M_PI;
  }
  writeI2SBuffer(buffer, samples * 2);
  free(buffer);
}

// One-shot trigger, called per second from client for tight sync
// One-shot (kept for compatibility)
static void triggerTickTockOnce() {
  setupI2S();
  if (!i2sReady) return;
  switch (gSoundMode) {
    case SOUND_OFF: break;
    case SOUND_CRICK: playTick(); break;
    case SOUND_SOFT: playSoft(); break;
    default: break;
  }
}

// Periodic sound timer (avoids request latency)
static TaskHandle_t gSoundTask = nullptr;
static volatile bool gSoundRun = false;
static volatile uint32_t gSoundPeriodMs = 1000;
static void soundTimerTask(void* arg) {
  setupI2S();
  // Align to next exact period boundary to reduce perceived lag/jitter
  uint32_t now = millis();
  uint32_t rem = gSoundPeriodMs ? (gSoundPeriodMs - (now % gSoundPeriodMs)) % gSoundPeriodMs : 0;
  if (rem) vTaskDelay(pdMS_TO_TICKS(rem));
  TickType_t last = xTaskGetTickCount();
  TickType_t period = pdMS_TO_TICKS(gSoundPeriodMs);
  uint32_t lastPlay = millis();
  while (gSoundRun) {
    uint32_t t = millis();
    // Ensure minimum 800 ms between plays to avoid overlap/double-trigger effects
    if ((int32_t)(t - lastPlay) >= 800) {
      lastPlay = t;
      switch (gSoundMode) {
        case SOUND_OFF: break;
        case SOUND_CRICK: playTick(); break;
        case SOUND_SOFT: playSoft(); break;
        default: break;
      }
    }
    vTaskDelayUntil(&last, period);
  }
  vTaskDelete(NULL);
}

static void startSoundTimer(uint32_t periodMs) {
  if (gSoundTask) return;
  // Enforce minimum period 800 ms to avoid overlaps
  if (periodMs < 800) periodMs = 800;
  gSoundPeriodMs = periodMs;
  buildSoundBuffers(); // ensure prebuilt buffers exist before first tick
  gSoundRun = true;
  // Pin to core 1 with slightly higher priority to avoid jitter
  xTaskCreatePinnedToCore(soundTimerTask, "snd_timer", 4096, nullptr, 3, &gSoundTask, 1);
}

static void stopSoundTimer() {
  gSoundRun = false;
  if (gSoundTask) { TaskHandle_t t = gSoundTask; gSoundTask = nullptr; vTaskDelete(t); }
}

// YouTube config
static const char* YT_API_KEY = "AIzaSyCAKj7eDgmQm4B2b9OFyKFLvgiLEjrOoNo";
static const char* YT_CHANNEL_ID = "UCaPOzWiPWJFJr9dXzkkvUOw";
static String gYTChannelId; // override from NVS
static unsigned long yt_last_fetch = 0;
static String yt_cached_json;
static String yt_cached_subs;
static String yt_last_id;

// Uploaded text bitmap (RGB565), text-only cropped image
static std::vector<uint8_t> uploadBuf;      // raw bytes as received (header + pixels)
static std::vector<uint16_t> textPixels;    // pixels only, RGB565
static std::vector<uint8_t>  textAlpha;     // optional A8 alpha per pixel
static std::vector<uint16_t> frameBuffer;   // full virtual offscreen RGB565
static std::vector<uint16_t> bgPixels;      // optional background image (virtual-sized)
static bool hasBgImage = false;
static uint16_t imgW = 0, imgH = 0;         // text image size
// Panel config (for multi-panel awareness)
static int g_panel_rows = NUM_ROWS; // hardware default rows
static int g_panel_cols = NUM_COLS; // hardware default cols
static String g_panel_map; // optional: comma-separated indices/names from UI
static std::vector<uint8_t> g_panel_active; // 1=enabled, 0=disabled per physical panel index

// Render settings from client
static uint16_t bgColor = 0x0000;           // RGB565 background
static uint16_t textColor = 0xFFFF;          // ADD: RGB565 text color
static int16_t userOffX = 0;                // base X offset
static int16_t userOffY = 0;                // base Y offset
static bool animate = false;                // scroll enable
static int8_t animDir = -1;                 // -1 = left, +1 = right
static uint16_t animSpeedMs = 30;           // delay between frames (10..60)
static int16_t  loopOffsetPx = 0;           // loop overlap/gap in pixels: <0 overlap, >0 gap

// Animation state
static int16_t scrollX = 0;                 // current scroll position (left of text)
static int16_t baseY = 0;                   // vertically centered baseline + userOffY
static uint32_t lastAnim = 0;
static uint32_t restartAt = 0;              // time to restart next cycle
static bool waitingRestart = false;
static std::vector<int16_t> heads;         // multi-head array for continuous text stream

// ================= Alpha Blending Helpers (RGB565) =================
static inline uint16_t blend565(uint16_t src565, uint16_t dst565, uint8_t a) {
  if (a == 0) return dst565;
  if (a == 255) return src565;
  // Extract to 8-bit components
  uint8_t sr = (src565 >> 8) & 0xF8; sr |= sr >> 5;
  uint8_t sg = (src565 >> 3) & 0xFC; sg |= sg >> 6;
  uint8_t sb = (src565 << 3) & 0xF8; sb |= sb >> 5;
  uint8_t dr = (dst565 >> 8) & 0xF8; dr |= dr >> 5;
  uint8_t dg = (dst565 >> 3) & 0xFC; dg |= dg >> 6;
  uint8_t db = (dst565 << 3) & 0xF8; db |= db >> 5;
  // Alpha blend: out = (src*a + dst*(255-a)) / 255
  uint16_t ia = 255 - a;
  uint8_t r = (uint8_t)((sr * a + dr * ia + 127) / 255);
  uint8_t g = (uint8_t)((sg * a + dg * ia + 127) / 255);
  uint8_t b = (uint8_t)((sb * a + db * ia + 127) / 255);
  // Pack back to 565
  return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
}

// Display mode tracking
enum DisplayMode { MODE_NONE, MODE_CLOCK, MODE_THEME };
static DisplayMode currentMode = MODE_NONE;

// Persistent storage structure
struct LastSettings {
  bool animate;
  int8_t animDir;
  uint16_t animSpeedMs;
  uint8_t speedPercent;      // ADD: Speed percentage (10-100) for proper saving/loading
  int16_t loopOffsetPx;
  uint16_t bgColor;
  uint16_t textColor;        // ADD: Text color
  uint16_t brightness;
  DisplayMode mode;
  bool hasText;
  bool hasBgImage;
  uint16_t textWidth;
  uint16_t textHeight;
  int16_t scrollX;           // Current scroll position
  uint16_t spacing;          // Animation spacing
  uint32_t savedTime;        // When the state was saved
};

