SoyVitouPro/ESP32-V2/src/main.cpp
  // Save frame buffer to file
  File file = LittleFS.open("/last_frame.rgb565", "w");
  if (!file) {
    Serial.println("Failed to open last frame file for writing");
    return;
  }

  size_t bytesToWrite = frameBuffer.size() * sizeof(uint16_t);
  size_t written = file.write(reinterpret_cast<const uint8_t*>(frameBuffer.data()), bytesToWrite);
  file.close();

  if (written == bytesToWrite) {
    Serial.printf("Last frame saved: %u bytes\n", (unsigned)written);
  } else {
    Serial.printf("Error saving last frame: wrote %u of %u bytes\n", (unsigned)written, (unsigned)bytesToWrite);
  }

  // Also save background image data if present
  if (hasBgImage && !bgPixels.empty()) {
    File bgFile = LittleFS.open("/last_bg.rgb565", "w");
    if (bgFile) {
      size_t bgBytesToWrite = bgPixels.size() * sizeof(uint16_t);
      size_t bgWritten = bgFile.write(reinterpret_cast<const uint8_t*>(bgPixels.data()), bgBytesToWrite);
      bgFile.close();
      Serial.printf("Background image saved: %u bytes\n", (unsigned)bgWritten);
    } else {
      Serial.println("Failed to save background image file");
    }
  }

  // Also save text data if we have it (for animation restoration)
  if (!textPixels.empty()) {
    File textFile = LittleFS.open("/last_text.dat", "w");
    if (textFile) {
      // Save header with dimensions and color
      uint8_t header[8];
      header[0] = imgW & 255;
      header[1] = (imgW >> 8) & 255;
      header[2] = imgH & 255;
      header[3] = (imgH >> 8) & 255;
      header[4] = textAlpha.empty() ? 0 : 1; // Alpha flag
      header[5] = textColor & 255;
      header[6] = (textColor >> 8) & 255;
      header[7] = 0; // Reserved
      textFile.write(header, 8);

      // Save text pixels
      size_t textBytes = textPixels.size() * sizeof(uint16_t);
      textFile.write(reinterpret_cast<const uint8_t*>(textPixels.data()), textBytes);

      // Save alpha channel if present
      if (!textAlpha.empty()) {
        textFile.write(textAlpha.data(), textAlpha.size());
      }

      textFile.close();
      Serial.printf("Text data saved: %u pixels\n", (unsigned)textPixels.size());
    }
  }
}

static void loadLastFrame() {
  // Try to load text data first
  File textFile = LittleFS.open("/last_text.dat", "r");
  if (textFile) {
    Serial.println("Loading saved text data...");

    // Read header
    uint8_t header[8];
    if (textFile.read(header, 8) == 8) {
      uint16_t savedImgW = header[0] | (header[1] << 8);
      uint16_t savedImgH = header[2] | (header[3] << 8);
      bool hasAlpha = (header[4] == 1);
      uint16_t savedTextColor = header[5] | (header[6] << 8);

      // Restore text color
      textColor = savedTextColor;
      Serial.printf("Restored text color: 0x%04X\n", textColor);

      // Load text pixels
      size_t textPixelCount = savedImgW * savedImgH;
      textPixels.resize(textPixelCount);
      size_t textBytesToRead = textPixelCount * sizeof(uint16_t);
      size_t textBytesRead = textFile.read(reinterpret_cast<uint8_t*>(textPixels.data()), textBytesToRead);

      // Load alpha channel if present
      if (hasAlpha && textBytesRead == textBytesToRead) {
        textAlpha.resize(textPixelCount);
        size_t alphaBytesRead = textFile.read(textAlpha.data(), textPixelCount);
        if (alphaBytesRead == textPixelCount) {
          Serial.printf("Text data loaded: %ux%u pixels with alpha\n", savedImgW, savedImgH);
        } else {
          Serial.printf("Error loading alpha channel: read %u of %u bytes\n", (unsigned)alphaBytesRead, (unsigned)textPixelCount);
          textAlpha.clear();
        }
      } else {
        textAlpha.clear();
        Serial.printf("Text data loaded: %ux%u pixels without alpha\n", savedImgW, savedImgH);
      }

      if (textBytesRead == textBytesToRead) {
        imgW = savedImgW;
        imgH = savedImgH;
      }
    }
    textFile.close();
  }

  // Load the frame buffer
  File file = LittleFS.open("/last_frame.rgb565", "r");
  if (!file) {
    Serial.println("No last frame file found");
    return;
  }

  size_t fileSize = file.size();
  size_t expectedSize = VIRT_W() * VIRT_H() * sizeof(uint16_t);

  if (fileSize != expectedSize) {
    Serial.printf("Last frame size mismatch: %u bytes, expected %u bytes\n", (unsigned)fileSize, (unsigned)expectedSize);
    file.close();
    return;
  }

  // Resize frame buffer and load data
  frameBuffer.resize(VIRT_W() * VIRT_H());
  size_t read = file.read(reinterpret_cast<uint8_t*>(frameBuffer.data()), fileSize);
  file.close();

  if (read == fileSize) {
    Serial.printf("Last frame loaded: %u bytes\n", (unsigned)read);

    // Try to load background image if it exists
    File bgFile = LittleFS.open("/last_bg.rgb565", "r");
    if (bgFile) {
      size_t bgFileSize = bgFile.size();
      size_t expectedBgSize = VIRT_W() * VIRT_H() * sizeof(uint16_t);

      if (bgFileSize == expectedBgSize) {
        bgPixels.resize(VIRT_W() * VIRT_H());
        size_t bgRead = bgFile.read(reinterpret_cast<uint8_t*>(bgPixels.data()), bgFileSize);
        bgFile.close();

        if (bgRead == bgFileSize) {
          hasBgImage = true;
          Serial.printf("Background image loaded: %u bytes\n", (unsigned)bgRead);
        } else {
          Serial.printf("Error loading background image: read %u of %u bytes\n", (unsigned)bgRead, (unsigned)bgFileSize);
          bgPixels.clear();
          hasBgImage = false;
        }
      } else {
        Serial.printf("Background image size mismatch: %u bytes, expected %u bytes\n", (unsigned)bgFileSize, (unsigned)expectedBgSize);
        bgFile.close();
        hasBgImage = false;
      }
    } else {
      Serial.println("No saved background image found");
      hasBgImage = false;
    }

    // Display the last frame immediately
    if (vdisplay && !frameBuffer.empty()) {
      vdisplay->drawRGBBitmap(0, 0, frameBuffer.data(), VIRT_W(), VIRT_H());
      Serial.println("Last frame displayed on startup");
    }

    // Restore animation if needed - IMPROVED VERSION
    if (lastSettings.animate && lastSettings.hasText && !textPixels.empty()) {
      Serial.println("Restoring animation state with text and colors");

      // Initialize basic animation state
      baseY = (int)VIRT_H() / 2 - (int)imgH / 2 + userOffY;
      currentMode = MODE_CLOCK; // Set to clock mode to enable animation loop

      // Ensure all color settings are properly restored
      Serial.printf("Restored colors - BG: 0x%04X, Text: 0x%04X\n", bgColor, textColor);

      // Simple spacing calculation
      int spacing = imgW + loopOffsetPx;
      if (spacing < 1) spacing = 1;

