SoyVitouPro/ESP32-V2/src/main.cpp
      // Stop clock mode if it was running
      if (currentMode == MODE_CLOCK) {
        Serial.println("Stopping clock mode, switching to theme mode");
        animate = false;  // Stop clock animation
        textPixels.clear();  // Clear text pixels to stop clock display
      }
      currentMode = MODE_THEME;

      sendCORSHeaders();
      server.send(200, "text/plain", "Theme uploaded successfully");
    } else {
      Serial.println("/upload_theme: Failed to save theme (file not open)");
      sendCORSHeaders();
      server.send(500, "text/plain", "Failed to save theme");
    }
  }
}

void setup() {
  Serial.begin(115200);
  delay(100);
  Serial.println("Starting HUB75 + WebServer for Khmer text...");

  // Initialize NVS
  esp_err_t err = nvs_flash_init();
  if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
    // NVS partition was truncated and needs to be erased
    Serial.println("Erasing NVS flash...");
    ESP_ERROR_CHECK(nvs_flash_erase());
    err = nvs_flash_init();
  }
  ESP_ERROR_CHECK(err);
  Serial.println("NVS initialized");

  randomSeed(micros());

  // Module configuration
  HUB75_I2S_CFG mxconfig(
    PANEL_RES_X,
    PANEL_RES_Y,
    PANEL_CHAIN
  );

  // Pin mapping
  mxconfig.gpio.r1 = R1_PIN;
  mxconfig.gpio.g1 = G1_PIN;
  mxconfig.gpio.b1 = B1_PIN;
  mxconfig.gpio.r2 = R2_PIN;
  mxconfig.gpio.g2 = G2_PIN;
  mxconfig.gpio.b2 = B2_PIN;
  mxconfig.gpio.a = A_PIN;
  mxconfig.gpio.b = B_PIN;
  mxconfig.gpio.c = C_PIN;
  mxconfig.gpio.d = D_PIN;
  mxconfig.gpio.e = E_PIN;
  mxconfig.gpio.lat = LAT_PIN;
  mxconfig.gpio.oe = OE_PIN;
  mxconfig.gpio.clk = CLK_PIN;

  // Panel driver/timing options
  mxconfig.clkphase = false;
  mxconfig.driver = HUB75_I2S_CFG::FM6124;

  // Display Setup
  dma_display = new MatrixPanel_I2S_DMA(mxconfig);
  if (!dma_display->begin()) {
    Serial.println("MatrixPanel_I2S_DMA begin() failed!");
    while (true) { delay(1000); }
  }
  dma_display->setBrightness8(200);
  dma_display->clearScreen();
  // Virtual matrix wrapper for chaining/mapping (uses enum PANEL_CHAIN_TYPE)
  vdisplay = new VirtualMatrixPanel(*dma_display, cur_rows, cur_cols, PANEL_RES_X, PANEL_RES_Y, VIRTUAL_MATRIX_CHAIN_TYPE);
  // Clear screen
  vdisplay->fillScreen(dma_display->color565(0, 0, 0));
  frameBuffer.assign((size_t)VIRT_W() * (size_t)VIRT_H(), 0);

  // Initialize panel-active mask to hardware (all ON by default)
  g_panel_active.assign((size_t)cur_rows * (size_t)cur_cols, 1);

  // Draw seam guides for current layout
  if (cur_cols > 1) {
    for (int y = 0; y < VIRT_H(); ++y) vdisplay->drawPixel(PANEL_RES_X, y, vdisplay->color565(0, 64, 255));
  }
  if (cur_rows > 1) {
    for (int x = 0; x < VIRT_W(); ++x) vdisplay->drawPixel(x, PANEL_RES_Y, vdisplay->color565(0, 64, 255));
  }

  // Mount LittleFS to serve index.html
  if (!LittleFS.begin(true)) {
    Serial.println("LittleFS mount failed");
  } else {
    Serial.println("LittleFS mounted");
  }

  // Load saved settings and last frame
  loadLastSettings();
  loadLastFrame();

  // Bring up Wi-Fi AP and web server
  WiFi.mode(WIFI_AP);
  if (!WiFi.softAP(AP_SSID, AP_PASS)) {
    Serial.println("SoftAP failed");
  } else {
    Serial.print("AP SSID: "); Serial.println(AP_SSID);
    Serial.print("AP IP: "); Serial.println(WiFi.softAPIP());
  }
  server.on("/", HTTP_GET, handleRoot);
  server.onNotFound(handleStaticFile);
  server.on("/upload", HTTP_POST, handleUploadDone, handleUploadData);
  server.on("/upload_bg", HTTP_POST, handleUploadBgDone, handleUploadBgData);
  server.on("/upload_theme", HTTP_POST, [](){ server.send(200, "text/plain", "Theme upload complete"); }, handleUploadTheme);
  server.on("/stop_clock", HTTP_POST, [](){
    sendCORSHeaders();
    Serial.println("Stopping clock animation");
    animate = false;  // Stop animation
    textPixels.clear();  // Clear text pixels to stop display
    currentMode = MODE_NONE;  // Set mode to none
    server.send(200, "text/plain", "Clock stopped");
  });
  server.on("/stop_theme", HTTP_POST, [](){
    sendCORSHeaders();
    Serial.println("Stopping theme mode");
    currentMode = MODE_NONE;  // Set mode to none
    // Clear display
    if (vdisplay) {
      vdisplay->fillScreen(0);
    }
    server.send(200, "text/plain", "Theme stopped");
  });

  // CORS preflight handler
  server.on("/upload", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/upload_bg", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/upload_theme", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/theme_status", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/panel_info", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/panel_layout", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/wifi_scan", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/wifi_connect", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/wifi_status", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/yt_stats", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/proxy_image", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/yt_icon_download", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/themes_ids", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/theme_download", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/yt_icon_current", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/upload_icon", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  // Channel ID save/load
  server.on("/yt_channel", HTTP_OPTIONS, [](){ sendCORSHeaders(); server.send(200, "text/plain", ""); });
  server.on("/yt_channel", HTTP_GET, [](){
    sendCORSHeaders();
    String id = gYTChannelId.length() ? gYTChannelId : String(YT_CHANNEL_ID);
    server.send(200, "application/json", String("{\"id\":\"") + id + "\"}");
  });
  server.on("/yt_channel", HTTP_POST, [](){
    sendCORSHeaders();
    if (!server.hasArg("id")) { server.send(400, "text/plain", "missing id"); return; }
    String id = server.arg("id"); id.trim();
    if (id.length() == 0) { server.send(400, "text/plain", "empty id"); return; }
    nvs_handle_t nvs_handle; esp_err_t err = nvs_open("storage", NVS_READWRITE, &nvs_handle);
    if (err != ESP_OK) { server.send(500, "text/plain", "nvs open failed"); return; }
    nvs_set_str(nvs_handle, "yt_channel", id.c_str());
    nvs_commit(nvs_handle); nvs_close(nvs_handle);
    gYTChannelId = id;
    server.send(200, "application/json", String("{\"ok\":true,\"id\":\"") + id + "\"}");
  });
  server.on("/stop_clock", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  server.on("/stop_theme", HTTP_OPTIONS, [](){
    sendCORSHeaders();
    server.send(200, "text/plain", "");
  });
  // Panel layout configuration: configure panel arrangement
  // usage: POST /panel_layout layout=1x1
  server.on("/panel_layout", HTTP_POST, [](){
    if (!server.hasArg("layout")) { server.send(400, "text/plain", "Missing layout"); return; }
    String l = server.arg("layout"); l.toLowerCase();
    int new_rows = cur_rows, new_cols = cur_cols;
    if (l == "1x1") { new_rows = 1; new_cols = 1; }
    else { server.send(400, "text/plain", "Invalid layout"); return; }

