SoyVitouPro/ESP32-V2/src/main.cpp
        // Bounds checking optimization
        if (x0 + imgW_local <= 0 || x0 >= frameW) continue;

        // Optimized inner loops with minimal bounds checks
        for (int y = 0; y < imgH_local; ++y) {
          int dstY = baseY_local + y;
          if (dstY < 0 || dstY >= (int)VIRT_H()) continue;

          int srcRow = y * imgW_local;
          size_t frameRow = (size_t)dstY * frameW;

          // Optimized inner loop with pre-calculated bounds
          int startX = (x0 < 0) ? -x0 : 0;
          int endX = (x0 + imgW_local > frameW) ? (frameW - x0) : imgW_local;

          for (int x2 = startX; x2 < endX; ++x2) {
            int dstX = x0 + x2;
            size_t si = (size_t)srcRow + (size_t)x2;
            size_t frameIdx = frameRow + (size_t)dstX;

            // Optimized alpha blending
            if (!hasAlpha) {
              frameBuffer[frameIdx] = textPixels[si];
            } else {
              uint8_t a = textAlpha[si];
              if (a == 0) continue;
              frameBuffer[frameIdx] = blend565(textPixels[si], frameBuffer[frameIdx], a);
            }
          }
        }
      }

      // Display the updated frame
      vdisplay->drawRGBBitmap(0, 0, frameBuffer.data(), VIRT_W(), VIRT_H());

      // advance all heads - optimized
      const int gap = (int)loopOffsetPx;
      int spacing = (int)imgW_local + gap;
      if (spacing < 1) spacing = 1; // Ensure minimum spacing

      if (animDir < 0) { // left scrolling
        // Move all heads left
        for (int i = 0; i < (int)heads.size(); i++) {
          heads[i] -= 1;
        }

        // Recycle any head that goes completely off screen - FIXED VERSION
        for (int i = 0; i < (int)heads.size(); i++) {
          if (heads[i] + imgW <= 0) {
            // Find the rightmost head to position after it
            int rightmost = heads[0];
            for (int j = 1; j < (int)heads.size(); j++) {
              if (heads[j] > rightmost) rightmost = heads[j];
            }
            // Position immediately after the rightmost head with proper spacing
            heads[i] = rightmost + spacing;
            // Debug: ensure smooth transition
            // Serial.printf("Recycled head %d: old pos=%d, new pos=%d, spacing=%d\n", i, heads[i] - spacing, heads[i], spacing);
          }
        }
      } else { // right scrolling
        // Move all heads right
        for (int i = 0; i < (int)heads.size(); i++) {
          heads[i] += 1;
        }

        // Recycle any head that goes completely off screen - FIXED VERSION
        for (int i = 0; i < (int)heads.size(); i++) {
          if (heads[i] >= VIRT_W()) {
            // Find the leftmost head to position before it
            int leftmost = heads[0];
            for (int j = 1; j < (int)heads.size(); j++) {
              if (heads[j] < leftmost) leftmost = heads[j];
            }
            // Position immediately before the leftmost head with proper spacing
            heads[i] = leftmost - spacing;
            // Debug: ensure smooth transition
            // Serial.printf("Recycled head %d: old pos=%d, new pos=%d, spacing=%d\n", i, heads[i] + spacing, heads[i], spacing);
          }
        }
      }
    }
  } else {
    delay(2); // yield CPU when idle
  }
}
